---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.HydraulicSeparationAmbiguity
source: html/bf4579b9-bc4a-c61c-8224-c97c7e12f520.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.HydraulicSeparationAmbiguity Property

Unable to hydraulically separate until the system has flow.

## Syntax (C#)
```csharp
public static FailureDefinitionId HydraulicSeparationAmbiguity { get; }
```